export const detailSection1Data = [
  {
    title: "파란학기제",
    titleEn: "Paran Project",
    period: "{2022.03 - 2022.06}",
    role: "그래픽 디자인 - UI 디자인 - 웹 프론트엔드 개발",
    techStack: [
      "Design : Illustrator, Xd, Figma",
      "FrontEnd : HTML, CSS, JavaScript, React, Typescript",
    ],
    desc: [
      "아주대학교의  학기성 프로젝트인 파란학기제에서 ‘아주대학교 개발자들을 위한 커뮤니티 웹사이트’ 개발을 주제로 팀 프로젝트를 진행했습니다.",
      "그래픽 및 UI 디자이너로 참여하여, 로고 및 색상 등 아이덴티티 디자인, 대표 캐릭터 디자인, UI 디자인 작업을 진행했습니다.",
      "또한 게시글 목록 페이지에 대한 프론트엔드 개발에 참여하여 처음으로 프론트엔드 개발을 경험했습니다. Image Lazy Loading를 적용하여 화면에 보이지 않는 요소들을 렌더링 시키지 않음으로써 성능을 최적화하는 등의 사용자 편의성을 위한 개발을 진행하고자 노력했습니다.",
    ],
    meaning: [
      "해당 프로젝트는 프론트엔드 개발자의 꿈을 가지게 된 시작점이었습니다.",
      "다수의 그래픽 및 UI 디자인 경험만 있던 저에게, 제가 만든 UI들이 실제 사용자들에게 제공되는 과정을 과정을 경험해보며 프론트엔드의 매력을 깨달았습니다. 또한 데이터와 사용자를 잇는 교량으로서 프론트엔드의 중요성을 깨달았습니다.",
      "디자인 역량을 갖춘 프론트엔드 개발자로서 많은 사람들에게 창의적이고 편리하며 유용한 서비스를 제공하고 싶다는 목표를 가지게 됐습니다.",
    ],
  },
  {
    title: "래브라도랩스 인턴",
    titleEn: "LabradorLabs Intern",
    period: "{2023.01 - 2023.04}",
    role: "UI 디자인 - 웹 프론트엔드 개발",
    techStack: [
      "Design : Figma",
      "FrontEnd : HTML, CSS, JavaScript, React, Typescript, Redux, SCSS, StyledComponent",
    ],
    desc: [
      "래브라도랩스에서 프론트팀 인턴으로 4개월 간 활동했습니다.",
      "주 업무는 래브라도랩스의 서비스 플랫폼인 ‘소프트웨어 공급망 관리 플랫폼, 래브라도'의 분석 비교 페이지와 분석 요약 페이지 총 2페이지에 대한 UI 디자인 및 프론트엔드 개발이었습니다.",
      "UI 기획을 바탕으로 Figma에서 UI 디자인을 진행했습니다. 특히 분석 비교 페이지의 경우, 크게 셀렉터, 탭, 테이블 영역으로 나눠지는 페이지의 디자인 타입을 2가지로 설정하여 5가지 디자인 안을 제작했습니다.",
      "프론트엔드 개발의 경우 React, Typescript를 주 기술스택으로 사용하여 진행하였고 Github의 커밋단위로 코드리뷰를 받았습니다.",
      "그 외에도 래브라도 내의 기존 UI를 정리 및 분석하여 코드에 반영하였고, 삼성화재 IVAS의 UI 디자인을 리뉴얼했습니다.",
    ],
    meaning: [
      "막연히 혼자 프론트엔드를 공부하며 잘 하고 있는지에 대한 의문이 들었고, 이러한 부분을 개선하기 위해 실무 경험을 통해 성장하는 것이 가장 좋은 해결책이라 생각해 래브래도랩스 인턴에 도전했습니다.",
      "단순히 주어진 업무를 수동적으로 진행하기 보다 주도적으로 업무를 해보고자 노력했습니다. 분석 비교 페이지에 단순히 CVSS 취약점 수를 숫자로 나타내기 보다 도넛차트를 통해 시각적 효율을 높이는 등 편의성을 제공하는 디자인을 도출하고자 노력했습니다.",
      "프론트엔드 개발 과정에서는 사수님께 커밋단위로 코드리뷰를 부탁드려 개선할 점을 배웠습니다. 이를 통해 React에서 컴포넌트화를 어떤 상황에 하면 좋을지와 훅들의 사용법을 배워 코드를 개선하고 최적화하는 경험을 해볼 수 있었습니다.",
      "또한 래브라도 기존 UI를 정리 및 분석하는 업무의 경우 직접 제안한 업무로, 직접 코드를 수정해보며 서비스에 새로운 기능을 도입하는 것 만큼, 기존 기능을 유지보수하는 것 역시 중요함을 깨달았습니다.",
      "결과적으로 사수님께 ‘회사 생활하며 만난 사람 중 가장 같이 일하고 싶은 사람’이라는 평을 들었습니다.",
    ],
  },
  {
    title: "미디어 프로젝트",
    titleEn: "Media Project",
    period: "{2023.09 - 2023.12}",
    role: "프로젝트 기획 - 그래픽 및 UI 디자인 - 웹 퍼블리싱",
    techStack: [
      "Design : Illustrator, Figma",
      "FrontEnd : HTML, CSS, JavaScript, React, SCSS, StyledComponent",
    ],
    desc: [
      "디지털미디어학과의 졸업 프로젝트인 미디어 프로젝트에서 ‘1인 디지털 미디어 예술가들을 위한 웹 전시 사이트'를 주제로 팀장으로서 모든 역할에 참여했습니다",
      "해당 사이트는 무명의 1인 예술가들이 자신의 포트폴리오를 쌓음과 동시에 관람객들 즉 사용자들에게 전시회를 제공하는 두 기능을 통해 자신을 알릴 기회를 만들 수 있도록 기획되었습니다. 또한 굿즈 혹은 작품의 판매 및 구매 기능의 수익 창출 구조도 구상했습니다.",
      "진행 과정은 우선 주제 선정 후 필요 기능들을 구상하고, 노션에 페이지 단위로 기능 명세서를 작성했습니다. 해당 명세서를 바탕으로 메인 페이지, 시작 페이지, 이달의 전시회 페이지 총 3가지 페이지에 대한 UI 디자인을 맡았습니다. 해당 페이지들은 감각적인 느낌의 디자인이 필요한 페이지였습니다. 또한 로고 디자인도 맡았습니다.",
      "백엔드 없이 퍼블리싱까지 개발을 진행하여, 전시회 작성 페이지 외의 모든 페이지 퍼블리싱을 담당했습니다. 퍼블리싱은 React, SCSS, Styled Component를 주 기술스택으로 진행했습니다.",
    ],
    meaning: [
      "해당 프로젝트는 위기를 극복한 경험이었습니다. 기존에는 백엔드 팀원도 존재하여 디자인 1, 프론트 2, 백엔드 1로 구성되었지만 백엔드 팀원의 갑작스러운 휴학으로 인해 프로젝트의 방향성을 바꿔야 하는 상황이었습니다. 이미 모든 팀이 구성된 상황이라 추가 인원을 모집할 수 없었기에 긴급 회의를 통해 디자인 측면을 강화하여 퍼블리싱까지 진행하는 것으로 결정했습니다.",
      "이를 위해 기존에는 프론트만 맡기로 하였지만 팀장으로서 중요한 디자인 페이지들과 로고 디자인을 맡았습니다. 또한 피그마를 통해 디자인에 대한 코멘트를 작성하며 감각적이면서 사용자 편의성을 고려한 UI를 제작하고자 노력했습니다.",
      "퍼블리싱 쪽에서는 다른 프론트 팀원이 이번 프로젝트를 시작으로 프론트를 배워보는 계기였기에, 최소한의 페이지를 맡게 하여, 어려운 점이 있으면 시간이 나는 대로 프론트 미팅을 열어 코드 리뷰 등 문제점을 함께 해결해보고자 했습니다.",
      "이를 계기로 어떠한 어려움이든 극복할 수 있는 능력을 쌓을 수 있었습니다.",
    ],
  },
  {
    title: "플리트소프트 인턴",
    titleEn: "Plitsoft Intern",
    period: "{2024.01 - 2024.06}",
    role: "웹 및 모바일 프론트엔드 개발",
    techStack: [
      "FrontEnd : HTML, CSS, JavaScript, React, Typescript, Next.js, Stackflow, Turbo, TailwindCSS",
    ],
    desc: [
      "플리트소프트에서 6개월 동안 프론트엔드 개발자로 업무를 진행했습니다.",
      "우선적으로 혼자 플리트소프트의 홈페이지 리뉴얼을 맡아 UI 디자인을 바탕으로, 프론트엔드 개발을 React, TypeScript, Nextjs를 사용하여 진행했습니다. ",
      "다음으로는 운동센터 통합 관리 웹 및 모바일 플랫폼 개발 프로젝트 'SNPE 프로젝트'에서 프론트엔드 개발을 담당했습니다. WBS 상의 역할분담을 토대로 웹 플랫폼의 회원가입, 센터, 프로그램 등의 페이지, 모바일 플랫폼의 회원, 마이페이지 등의 페이지 개발을 담당했습니다. 웹 개발의 경우 React, TypeScript, Next.js, Turbo 등의 기술 스택을 사용했고 모바일 개발의 경우 Stackflow의 사용을 제안했습니다.",
    ],
    meaning: [
      "플리트소프트에서의 인턴 활동을 통해 진정한 협업을 경험했습니다.",
      "WBS 상의 역할분담만으로는 원활한 협업이 힘들 것이라 판단하여 데일리 스크럼의 도입을 제안했습니다. 이를 토대로 매일 각자의 진행상황, 어려움 및 개선하면 좋을 점 등을 공유하는 시간을 가졌습니다. 또한 개발의 한 사이클이 끝나면 QA를 진행하여 페이지별로 개선 및 수정사항들을 작성하여 우선순위에 따라 코드를 수정해 나갔습니다.",
      "해당 인턴은 협업을 경험함으로써 팀 내에서 제가 해야할 일들을 명확히 하고 더 나아가 할 수 있는 일들을 찾아볼 수 있는 시간이었습니다. 또한 원활한 의사소통을 바탕으로 팀원들이 서비스 개발이라는 공통의 목표를 설정하고 이를 향해 나아가면서 함께 많은 성취감을 얻을 수 있었습니다.",
    ],
  },
];
